
CombuctorDB4 = {
	["version"] = "603",
	["global"] = {
		["maxScale"] = 1.2,
	},
	["profiles"] = {
		["森保圆 - 洛丹伦"] = {
			["inventory"] = {
				["h"] = 166.000015258789,
				["position"] = {
					"RIGHT", -- [1]
				},
				["showBags"] = false,
				["bags"] = {
					0, -- [1]
					1, -- [2]
					2, -- [3]
					3, -- [4]
					4, -- [5]
				},
				["w"] = 72,
				["sets"] = {
					"全部", -- [1]
					"装备", -- [2]
					"商品", -- [3]
					"任务", -- [4]
					"消耗品", -- [5]
					"其它", -- [6]
				},
			},
			["bank"] = {
				["h"] = 166.000015258789,
				["position"] = {
					"LEFT", -- [1]
				},
				["showBags"] = false,
				["bags"] = {
					-1, -- [1]
					5, -- [2]
					6, -- [3]
					7, -- [4]
					8, -- [5]
					9, -- [6]
					10, -- [7]
					11, -- [8]
					-3, -- [9]
				},
				["w"] = 72,
				["sets"] = {
					"全部", -- [1]
					"装备", -- [2]
					"商品", -- [3]
					"任务", -- [4]
					"消耗品", -- [5]
					"其它", -- [6]
				},
			},
		},
	},
}
BF_VoidStorageDB = nil
