
Quartz3DB = {
	["namespaces"] = {
		["Swing"] = {
		},
		["Buff"] = {
		},
		["Interrupt"] = {
		},
		["Flight"] = {
		},
		["Pet"] = {
			["profiles"] = {
				["洛丹伦"] = {
					["x"] = 810.22216796875,
				},
				["Default"] = {
					["x"] = 810.22216796875,
				},
				["森保圆 - 洛丹伦"] = {
					["x"] = 810.22216796875,
				},
			},
		},
		["Player"] = {
			["profiles"] = {
				["洛丹伦"] = {
					["h"] = 20,
					["x"] = 785.22216796875,
					["texture"] = "Minimalist",
				},
				["Default"] = {
					["h"] = 20,
					["x"] = 785.22216796875,
					["texture"] = "Minimalist",
				},
				["森保圆 - 洛丹伦"] = {
					["h"] = 20,
					["x"] = 785.22216796875,
					["texture"] = "Minimalist",
				},
			},
		},
		["EnemyCasts"] = {
		},
		["GCD"] = {
		},
		["Focus"] = {
			["profiles"] = {
				["洛丹伦"] = {
					["y"] = 769.687683105469,
					["x"] = 495.539184570313,
				},
				["Default"] = {
					["y"] = 769.687683105469,
					["x"] = 495.539184570313,
				},
				["森保圆 - 洛丹伦"] = {
					["y"] = 769.687683105469,
					["x"] = 495.539184570313,
				},
			},
		},
		["Target"] = {
			["profiles"] = {
				["洛丹伦"] = {
					["y"] = 798.388305664063,
					["h"] = 20,
					["w"] = 280,
					["x"] = 740.520446777344,
				},
				["Default"] = {
					["y"] = 798.388305664063,
					["h"] = 20,
					["w"] = 280,
					["x"] = 740.520446777344,
				},
				["森保圆 - 洛丹伦"] = {
					["h"] = 20,
					["w"] = 280,
					["y"] = 798.388305664063,
					["x"] = 740.520446777344,
				},
			},
		},
		["Mirror"] = {
		},
		["Range"] = {
		},
		["Latency"] = {
		},
	},
	["profileKeys"] = {
		["一天三泡粑粑 - 洛丹伦"] = "Default",
		["森保圆 - 洛丹伦"] = "森保圆 - 洛丹伦",
	},
	["profiles"] = {
		["洛丹伦"] = {
			["modules"] = {
				["Pet"] = false,
			},
		},
		["Default"] = {
			["modules"] = {
				["Pet"] = false,
			},
		},
		["森保圆 - 洛丹伦"] = {
			["modules"] = {
				["Pet"] = false,
			},
		},
	},
}
