
RAIDBUILDER_UI_DB = {
	["global"] = {
		["annData"] = {
			{
				["unread"] = true,
				["title"] = "集合石插件新版本发布",
				["content"] = "集合石插件最新版本60000.03已经发布。可在官方网页http://w.163.com/special/wowsocial/进行更新。\n1.适配魔兽6.0版本\n2.解决与部分新版整合插件冲突问题\n如有问题，大家可通过集合石反馈QQ群：317548615 主动联系我们。",
			}, -- [1]
			{
				["unread"] = true,
				["title"] = "集合石插件维护公告",
				["content"] = "为适应6.0版本，集合石于10月16日（周四）进行版本维护。期间玩家可能无法正常使用集合石，我们会在维护好后会第一时间在战网论坛，游戏公告内通知大家。期间有任何问题大家也可以通过集合石反馈QQ群：317548615主动联系我们。",
			}, -- [2]
		},
		["serverDatas"] = {
			["AnnData"] = "^1^SAnnData^T^Stitle^S集合石插件新版本发布^Scontent^S集合石插件最新版本60000.03已经发布。可在官方网页http://w.163.com/special/wowsocial/进行更新。~J1.适配魔兽6.0版本~J2.解决与部分新版整合插件冲突问题~J如有问题，大家可通过集合石反馈QQ群：317548615~`主动联系我们。^t^^",
			["MallData"] = "^1^SMallData^T^S60分#1^S1001;60;49288;30141;2#1001;60;49289;30518;1^S120分#2^S2001;120;79744;40538#2002;120;68841;37846^S150分#3^S3001;150;93669;47348#3002;150;33219^S240分#4^S4001;240;72161;38925^S280分#5#1^S5001;280;54452^S600分#6^S6001;600;72159;19939^t^^",
		},
	},
	["profileKeys"] = {
		["一天三泡粑粑 - 洛丹伦"] = "一天三泡粑粑 - 洛丹伦",
		["森保圆 - 洛丹伦"] = "森保圆 - 洛丹伦",
	},
	["profiles"] = {
		["一天三泡粑粑 - 洛丹伦"] = {
		},
		["森保圆 - 洛丹伦"] = {
		},
	},
}
