BattlePetInfo_Save = BattlePetInfo_Save or {}
local maps = BattlePetInfo_Save.maps or {}
-----------------------------------------
-----------------------------------------
--每张地图中的野外小宠物
--由小宠物手册中抓取
-----------------------------------------
-----------------------------------------
local t_mapsdata = {
		["四风谷"] = {
			"发情的公鸡", -- [1]
			"四方水獭", -- [2]
			"四方水獭幼崽", -- [3]
			"害羞的袋狸", -- [4]
			"泽地小歌手", -- [5]
			"超能浣熊", -- [6]
			"超能浣熊幼崽", -- [7]
			"软壳幼龟", -- [8]
			"野生蚕", -- [9]
			"马来箭鼠", -- [10]
			"马来箭鼠幼崽", -- [11]
		},
		["秘蓝岛"] = {
			"兔子", -- [1]
			"松鼠", -- [2]
			"灰蛾", -- [3]
			"老鼠", -- [4]
			"臭鼬", -- [5]
			"鸡", -- [6]
		},
		["旧通灵学院"] = {
			"老鼠", -- [1]
			"黑老鼠", -- [2]
		},
		["巨石之核"] = {
			"翡翠幼岩蛛", -- [1]
			"赤红幼岩蛛", -- [2]
			"黄宝石钻孔幼蛛", -- [3]
		},
		["冰冠冰川"] = {
			"痛苦的雏龙", -- [1]
			"蟑螂", -- [2]
		},
		["西瘟疫之地"] = {
			"兔子", -- [1]
			"凋零雄鹰", -- [2]
			"松鼠", -- [3]
			"黑老鼠", -- [4]
		},
		["永歌森林"] = {
			"兔子", -- [1]
			"小青蛙", -- [2]
			"猫", -- [3]
			"红玉树苗", -- [4]
			"蛇", -- [5]
			"蟾蜍", -- [6]
		},
		["龙骨荒野"] = {
			"极地野兔", -- [1]
			"海湾蟹", -- [2]
			"苔原企鹅", -- [3]
			"龙骨幼鸟", -- [4]
		},
		["艾尔文森林"] = {
			"兔子", -- [1]
			"小青蛙", -- [2]
			"小鹿", -- [3]
			"暴风城老鼠", -- [4]
			"松鼠", -- [5]
			"海鸥", -- [6]
			"猫", -- [7]
			"蜘蛛", -- [8]
			"鸡", -- [9]
			"黑羔羊", -- [10]
		},
		["凄凉之地"] = {
			"石犰狳",
			"亮鳞蜥蜴", -- [1]
			"小野兔", -- [2]
			"小青蛙", -- [3]
			"森林蛾", -- [4]
			"沙漠蜘蛛", -- [5]
			"石蝰蛇", -- [6]
			"紫晶幼岩蛛", -- [7]
			"红尾花栗鼠", -- [8]
			"老鼠", -- [9]
			"蟑螂", -- [10]
			"黄宝石钻孔幼蛛", -- [11]
		},
		["托尔巴拉德半岛"] = {
			"松鼠", -- [1]
			"码头老鼠", -- [2]
		},
		["月光林地"] = {
			"丝翅蛾", -- [1]
			"兔子", -- [2]
			"松鼠", -- [3]
			"森林蛾", -- [4]
		},
		["吉尔尼斯废墟"] = {
			"松鼠", -- [1]
			"老鼠", -- [2]
			"蜘蛛", -- [3]
			"蟾蜍", -- [4]
		},
		["安其拉"] = {
			"甲虫", -- [1]
			"蝎子", -- [2]
			"蟑螂", -- [3]
		},
		["卡桑琅丛林"] = {
			"云游节幼龟",
			"丛林幼虫", -- [1]
			"棘刺水龟", -- [2]
			"海湾蟹", -- [3]
			"海鸥", -- [4]
			"热毒牙幼蛛", -- [5]
			"紫水晶幼蛛", -- [6]
			"薄荷甲虫", -- [7]
			"露羽飞蛾", -- [8]
			"魅力闪耀者", -- [9]
		},
		["诅咒之地"] = {
			"小黑蝎", -- [1]
			"火甲虫", -- [2]
			"蜘蛛", -- [3]
			"蝎子", -- [4]
			"蝰蛇", -- [5]
		},
		["秘血岛"] = {
			"破坏者幼崽", -- [1]
			"老鼠", -- [2]
			"臭鼬", -- [3]
			"被感染的小鹿", -- [4]
			"被感染的松鼠", -- [5]
			"鸡", -- [6]
		},
		["萨隆矿坑"] = {
			"蜘蛛", -- [1]
			"黑老鼠", -- [2]
		},
		["破碎大厅"] = {
			"火甲虫", -- [1]
			"老鼠", -- [2]
			"蛇", -- [3]
			"黑老鼠", -- [4]
		},
		["纳格兰"] = {
			"兔子", -- [1]
			"松鼠", -- [2]
			"老鼠", -- [3]
			"草原土拨鼠", -- [4]
			"蛇", -- [5]
			"蝰蛇", -- [6]
			"蟾蜍", -- [7]
			"裂蹄小牛", -- [8]
		},
		["千针石林"] = {
			"暮光鬣蜥", -- [1]
			"蝎子", -- [2]
			"蟑螂", -- [3]
			"黑老鼠", -- [4]
		},
		["洛克莫丹"] = {
			"小青蛙", -- [1]
			"小黑山羊", -- [2]
			"松鼠", -- [3]
			"老鼠", -- [4]
			"蛇", -- [5]
			"蟑螂", -- [6]
		},
		["净化斯坦索姆"] = {
			"兔子", -- [1]
			"小鹿", -- [2]
			"猫", -- [3]
			"老鼠", -- [4]
			"蜘蛛", -- [5]
			"蟑螂", -- [6]
		},
		["暮色森林"] = {
			"兔子", -- [1]
			"暮色小蜘蛛", -- [2]
			"松鼠", -- [3]
			"耗子", -- [4]
			"臭鼬", -- [5]
			"蟑螂", -- [6]
			"锦蛇", -- [7]
			"鸡", -- [8]
			"黑老鼠", -- [9]
			"寡妇幼蛛",
		},
		["杜隆塔尔"] = {
			"恐惧爬行者", -- [1]
			"水蛇", -- [2]
			"蜣螂", -- [3]
			"蝰蛇", -- [4]
			"蟾蜍", -- [5]
			"野兔", -- [6]
			"骨刺蜥蜴", -- [7]
		},
		["安卡赫特：古代王国"] = {
			"蜘蛛", -- [1]
			"蟑螂", -- [2]
			"黑老鼠", -- [3]
		},
		["荒芜之地"] = {
			"刺蜥", -- [1]
			"响尾蛇", -- [2]
			"王蛇", -- [3]
			"甲虫", -- [4]
			"纹尾蝎", -- [5]
			"角蜥", -- [6]
			"金甲虫", -- [7]
			"黑老鼠", -- [8]
		},
		["暮光高地"] = {
			"响尾蛇", -- [1]
			"大蟾蜍", -- [2]
			"暮光小恶魔", -- [3]
			"暮光蜘蛛", -- [4]
			"水蛇", -- [5]
			"海湾蟹", -- [6]
			"灰色松鼠", -- [7]
			"蛮锤狮鹫幼崽", -- [8]
			"蝎子", -- [9]
			"蟑螂", -- [10]
			"高地火鸡", -- [11]
			"高地鼠", -- [12]
			"黄腹土拨鼠", -- [13]
			"黑老鼠", -- [14]
		},
		["银松森林"] = {
			"兔子", -- [1]
			"松鼠", -- [2]
			"生病的松鼠", -- [3]
			"老鼠", -- [4]
			"蛇", -- [5]
			"蟾蜍", -- [6]
			"被感染的小鹿", -- [7]
			"被感染的松鼠", -- [8]
		},
		["安戈洛环形山"] = {
			"丝翅蛾", -- [1]
			"双帆幼龙", -- [2]
			"斑点铃蛙", -- [3]
			"树蟒", -- [4]
			"火甲虫", -- [5]
			"燃灰蜥蜴", -- [6]
			"甲虫", -- [7]
			"翡翠树蚺", -- [8]
			"蟑螂", -- [9]
			"长尾地道鼠", -- [10]
			"鹦鹉", -- [11]
		},
		["嚎风峡湾"] = {
			"兔子", -- [1]
			"峡湾座狼幼崽", -- [2]
			"峡湾鼠", -- [3]
			"松鼠", -- [4]
			"海湾蟹", -- [5]
			"火鸡", -- [6]
			"老鼠", -- [7]
			"臭鼬", -- [8]
			"蛆虫", -- [9]
			"蛇", -- [10]
			"蜘蛛", -- [11]
			"蟑螂", -- [12]
			"蟾蜍", -- [13]
			"贪吃的蛆虫", -- [14]
			"鸡", -- [15]
		},
		["失落群岛"] = {
			"小青蛙", -- [1]
			"海湾蟹", -- [2]
			"老鼠", -- [3]
			"青蛙", -- [4]
		},
		["螳螂高原"] = {
			"猫鼬", -- [1]
			"猫鼬幼崽", -- [2]
			"草地欢跳者", -- [3]
			"魁潭猫鼬", -- [4]
			"琥珀飞蛾",
			"牦鼠",
		},
		["奥格瑞玛"] = {
			"机械小鸡", -- [1]
			"水蛇", -- [2]
			"蜘蛛", -- [3]
			"蜣螂", -- [4]
			"蝎子", -- [5]
			"蟾蜍", -- [6]
			"骨刺蜥蜴", -- [7]
		},
		["纳克萨玛斯"] = {
			"幼虫", -- [1]
			"老鼠", -- [2]
			"蛆虫", -- [3]
			"蜘蛛", -- [4]
		},
		["达纳苏斯"] = {
			"小野兔", -- [1]
			"小青蛙", -- [2]
			"森林蛾", -- [3]
			"红尾花栗鼠", -- [4]
		},
		["菲拉斯"] = {
			"兔子", -- [1]
			"松鼠", -- [2]
			"虚空精灵龙", -- [3]
			"蛇", -- [4]
		},
		["泰达希尔"] = {
			"兔子", -- [1]
			"小野兔", -- [2]
			"小青蛙", -- [3]
			"小鹿", -- [4]
			"松鼠", -- [5]
			"森林蛾", -- [6]
			"红尾花栗鼠", -- [7]
			"羽冠猫头鹰", -- [8]
			"蜘蛛", -- [9]
			"蟾蜍", -- [10]
		},
		["阿拉希盆地"] = {
			"老鼠", -- [1]
			"鸡", -- [2]
		},
		["遗忘之王古墓"] = {
			"黑老鼠", -- [1]
		},
		["永恒之井"] = {
			"松鼠", -- [1]
		},
		["费伍德森林"] = {
			"染病蛾", -- [1]
			"甲虫", -- [2]
			"腐化蟑螂", -- [3]
			"腐化鼠", -- [4]
			"蟾蜍", -- [5]
			"迷你地狱火", -- [6]
		},
		["灼热峡谷"] = {
			"火甲虫", -- [1]
			"熔岩蟹", -- [2]
			"熔火幼蛛", -- [3]
			"燃灰幼蛛", -- [4]
		},
		["地狱火半岛"] = {
			"剥石者幼崽", -- [1]
			"蝎子", -- [2]
			"蝰蛇", -- [3]
		},
		["银月城"] = {
			"兔子", -- [1]
			"猫", -- [2]
		},
		["哀嚎洞穴"] = {
			"蛇", -- [1]
			"黄蟾蜍", -- [2]
		},
		["魔导师平台"] = {
			"松鼠", -- [1]
		},
		["托尔巴拉德"] = {
			"蛇", -- [1]
		},
		["奥丹姆"] = {
			"响尾蛇", -- [1]
			"托维尔圣甲虫", -- [2]
			"斑点蝎", -- [3]
			"沙漠蜘蛛", -- [4]
			"绿洲蛾", -- [5]
			"翡翠树蚺", -- [6]
			"胶皮蛙", -- [7]
			"蜣螂", -- [8]
			"蝗虫", -- [9]
		},
		["达克萨隆要塞"] = {
			"甲虫", -- [1]
			"老鼠", -- [2]
			"蜘蛛", -- [3]
			"黑老鼠", -- [4]
		},
		["石爪山脉"] = {
			"兔子", -- [1]
			"喷毒幼蛛", -- [2]
			"坏松鼠5000型", -- [3]
			"山地臭鼬", -- [4]
			"珊瑚蛇", -- [5]
			"老鼠", -- [6]
			"蜘蛛", -- [7]
			"蟑螂", -- [8]
			"高地臭鼬", -- [9]
			"高山花栗鼠", -- [10]
		},
		["刀锋山"] = {
			"兔子", -- [1]
			"敏捷的洞穴蛛", -- [2]
			"松鼠", -- [3]
			"棕色土拨鼠", -- [4]
			"石蝰蛇", -- [5]
			"蝎子", -- [6]
			"鳞甲蜥蜴幼崽", -- [7]
		},
		["卡拉赞"] = {
			"老鼠", -- [1]
			"蜘蛛", -- [2]
		},
		["影月谷"] = {
			"燃灰蝰蛇", -- [1]
			"腐化蟑螂", -- [2]
			"蝎子", -- [3]
			"邪焰", -- [4]
		},
		["吉尔尼斯城"] = {
			"猫", -- [1]
			"老鼠", -- [2]
			"蜘蛛", -- [3]
			"蟑螂", -- [4]
		},
		["西部荒野"] = {
			"小小收割者", -- [1]
			"海湾蟹", -- [2]
			"耗子", -- [3]
			"草原土拨鼠", -- [4]
			"蛇", -- [5]
			"鸡", -- [6]
		},
		["北风苔原"] = {
			"北风土拨鼠", -- [1]
			"极地野兔", -- [2]
			"油腻软泥怪", -- [3]
			"海湾蟹", -- [4]
			"苔原企鹅", -- [5]
		},
		["逆风小径"] = {
			"不息之影", -- [1]
		},
		["荆棘谷海角"] = {
			"林地小蜘蛛", -- [1]
			"树蟒", -- [2]
			"海湾蟹", -- [3]
			"甲虫", -- [4]
			"码头老鼠", -- [5]
			"老鼠", -- [6]
			"蜥蜴幼崽", -- [7]
			"蟑螂", -- [8]
			"赤红飞蛾", -- [9]
			"长尾地道鼠", -- [10]
			"鹦鹉", -- [11]
			"小猩猩",
		},
		["虚空风暴"] = {
			"猫", -- [1]
			"耗子", -- [2]
			"虚空蟑螂", -- [3]
			"虚空鳐幼体", -- [4]
		},
		["南贫瘠之地"] = {
			"小青蛙", -- [1]
			"斑纹长颈鹿", -- [2]
			"翡翠树蚺", -- [3]
		},
		["古达克"] = {
			"蛇", -- [1]
		},
		["吉尔尼斯"] = {
			"小青蛙", -- [1]
			"松鼠", -- [2]
			"海湾蟹", -- [3]
			"老鼠", -- [4]
			"臭鼬", -- [5]
			"蛇", -- [6]
			"蜘蛛", -- [7]
			"蟑螂", -- [8]
			"蟾蜍", -- [9]
			"鸡", -- [10]
		},
		["影牙城堡"] = {
			"黑老鼠", -- [1]
		},
		["祖达克"] = {
			"大蟾蜍", -- [1]
			"小水花", -- [2]
			"极地野兔", -- [3]
			"蛇", -- [4]
			"蜘蛛", -- [5]
		},
		["黑色沼泽"] = {
			"蛇", -- [1]
		},
		["科赞"] = {
			"坏松鼠5000型", -- [1]
			"机械小兔", -- [2]
			"机械小鸡", -- [3]
			"海湾蟹", -- [4]
			"蟑螂", -- [5]
			"黑老鼠", -- [6]
		},
		["晶歌森林"] = {
			"兔子", -- [1]
			"松鼠", -- [2]
			"老鼠", -- [3]
		},
		["北贫瘠之地"] = {
			"小青蛙", -- [1]
			"猎豹幼崽", -- [2]
			"翡翠树蚺", -- [3]
			"草原土拨鼠", -- [4]
			"蝰蛇", -- [5]
			"鸡", -- [6]
			"黄蟾蜍", -- [7]
		},
		["东瘟疫之地"] = {
			"甲虫", -- [1]
			"腐烂蛆虫", -- [2]
			"蜘蛛", -- [3]
			"蝎子", -- [4]
			"蝙蝠", -- [5]
			"蟑螂", -- [6]
			"被感染的小鹿", -- [7]
			"被感染的松鼠", -- [8]
			"黑老鼠", -- [9]
		},
		["紫罗兰监狱"] = {
			"老鼠", -- [1]
			"蜘蛛", -- [2]
			"黑老鼠", -- [3]
		},
		["丹莫罗"] = {
			"兔子", -- [1]
			"小青蛙", -- [2]
			"松鼠", -- [3]
			"水晶蜘蛛", -- [4]
			"海湾蟹", -- [5]
			"老鼠", -- [6]
			"蛆虫", -- [7]
			"蛇", -- [8]
			"蜘蛛", -- [9]
			"蝰蛇", -- [10]
			"蟑螂", -- [11]
			"蟾蜍", -- [12]
			"辐射蟑螂", -- [13]
			"长尾地道鼠", -- [14]
			"雪豹幼崽", -- [15]
			"高山野兔", -- [16]
			"黑老鼠", -- [17]
		},
		["暴风城"] = {
			"兔子", -- [1]
			"松鼠", -- [2]
			"老鼠", -- [3]
			"草原土拨鼠", -- [4]
		},
		["太阳井高地"] = {
			"黑老鼠", -- [1]
		},
		["岩石大厅"] = {
			"金甲虫", -- [1]
			"黑老鼠", -- [2]
		},
		["闪电大厅"] = {
			"金甲虫", -- [1]
		},
		["剃刀高地"] = {
			"蟑螂", -- [1]
			"黑老鼠", -- [2]
		},
		["乌特加德之巅"] = {
			"甲虫", -- [1]
			"蜘蛛", -- [2]
			"黑老鼠", -- [3]
		},
		["索拉查盆地"] = {
			"松鼠", -- [1]
			"蛇", -- [2]
			"迷你碎角", -- [3]
			"黄蟾蜍", -- [4]
		},
		["黑暗神庙"] = {
			"蛇", -- [1]
			"蜘蛛", -- [2]
			"蟾蜍", -- [3]
		},
		["泰罗卡森林"] = {
			"曲行幼蜥", -- [1]
			"松鼠", -- [2]
			"纹尾蝎", -- [3]
			"老鼠", -- [4]
			"臭鼬", -- [5]
			"蛇", -- [6]
		},
		["深岩之洲"] = {
			"偷渡老鼠", -- [1]
			"暮光甲虫", -- [2]
			"暮光蜘蛛", -- [3]
			"水晶甲虫", -- [4]
			"深岩蟑螂", -- [5]
			"真菌飞蛾", -- [6]
			"紫晶幼岩蛛", -- [7]
			"翡翠幼岩蛛", -- [8]
			"血红晶簇", -- [9]
			"赤红幼岩蛛", -- [10]
			"黄宝石钻孔幼蛛", -- [11]
		},
		["灵魂洪炉"] = {
			"蜘蛛", -- [1]
			"黑老鼠", -- [2]
		},
		["尘泥沼泽"] = {
			"奥妮克希亚的雏龙", -- [1]
			"松鼠", -- [2]
			"耗子", -- [3]
			"蛇", -- [4]
			"蜘蛛", -- [5]
			"蟾蜍", -- [6]
			"鸡", -- [7]
			"黑老鼠", -- [8]
		},
		["翡翠林"] = {
			"丛林蟾蜍", -- [1]
			"假面狸猫", -- [2]
			"假面狸猫幼崽", -- [3]
			"塔边小蟹", -- [4]
			"寺院毒蛇", -- [5]
			"明镜水黾", -- [6]
			"林地毒蛇", -- [7]
			"沙地海燕", -- [8]
			"珊瑚毒蛇", -- [9]
			"珠丝蜗牛", -- [10]
			"神龛苍蝇", -- [11]
			"翡翠乌龟", -- [12]
			"翡翠乌龟", -- [13]
			"花园蛙", -- [14]
			"花园飞蛾", -- [15]
			"跳蛛", -- [16]
			"金钱豹蛙", -- [17]
			"鹿齿土拨鼠", -- [18]
		},
		["血色修道院"] = {
			"兔子", -- [1]
			"老鼠", -- [2]
		},
		["冰冠堡垒"] = {
			"蜘蛛", -- [1]
			"蟑螂", -- [2]
			"黑老鼠", -- [3]
		},
		["昆莱山"] = {
			"佐伊灵蛇", -- [1]
			"多莱兔仔", -- [2]
			"多莱野兔", -- [3]
			"平原监视者", -- [4]
			"泽川小鸡", -- [5]
			"草原鼠", -- [6]
			"高山小羊", -- [7]
			"高山幼狐", -- [8]
			"高山狐狸崽", -- [9]
		},
		["映像大厅"] = {
			"蜘蛛", -- [1]
		},
		["幽魂之地"] = {
			"小青蛙", -- [1]
			"幼虫", -- [2]
			"灵魂蟹", -- [3]
			"老鼠", -- [4]
			"蛆虫", -- [5]
			"蛇", -- [6]
			"蜘蛛", -- [7]
			"蟾蜍", -- [8]
		},
		["恐惧废土"] = {
			"君王蟹", -- [1]
			"坚忍蟑螂", -- [2]
			"安静的刺猬", -- [3]
			"拉帕纳海螺", -- [4]
			"硬壳蝎", -- [5]
			"迷糊的刺猬", -- [6]
			"琥珀飞蛾",
			"牦鼠",
		},
		["冬泉谷"] = {
			"坏松鼠5000型", -- [1]
			"山地臭鼬", -- [2]
			"机械小兔", -- [3]
			"机械小鸡", -- [4]
			"水晶蜘蛛", -- [5]
			"蜘蛛", -- [6]
			"高地臭鼬", -- [7]
			"高山花栗鼠", -- [8]
			"高山野兔", -- [9]
			"白色猫头鹰", 
		},
		["时光之末"] = {
			"蟑螂", -- [1]
		},
		["悲伤沼泽"] = {
			"噬鱼蛇", -- [1]
			"大蟾蜍", -- [2]
			"小青蛙", -- [3]
			"水蛇", -- [4]
			"沼泽蛾", -- [5]
			"海湾蟹", -- [6]
			"老鼠", -- [7]
			"蜘蛛", -- [8]
			"蟾蜍", -- [9]
			"鹦鹉", -- [10]
		},
		["沙塔斯城"] = {
			"老鼠", -- [1]
			"鸡", -- [2]
		},
		["湿地"] = {
			"兔子", -- [1]
			"山地臭鼬", -- [2]
			"松鼠", -- [3]
			"水蛇", -- [4]
			"耗子", -- [5]
			"蟾蜍", -- [6]
			"袖珍沼泽兽", -- [7]
			"高地臭鼬", -- [8]
			"鸡", -- [9]
			"黑老鼠", -- [10]
		},
		["死亡矿井"] = {
			"老鼠", -- [1]
		},
		["黑海岸"] = {
			"兔子", -- [1]
			"松鼠", -- [2]
			"老鼠", -- [3]
			"闪光湖蜗牛", -- [4]
			"黑海岸幼崽", -- [5]
		},
		["风暴峭壁"] = {
			"山地臭鼬", -- [1]
			"极地野兔", -- [2]
			"蜘蛛", -- [3]
			"高地臭鼬", -- [4]
			"极地狐狸崽",
		},
		["希尔斯布莱德丘陵"] = {
			"兔子", -- [1]
			"大蟾蜍", -- [2]
			"松鼠", -- [3]
			"染病的熊崽", -- [4]
			"红尾花栗鼠", -- [5]
			"老鼠", -- [6]
			"蛆虫", -- [7]
			"蜘蛛", -- [8]
			"蟾蜍", -- [9]
			"雪靴野兔", -- [10]
			"鸡", -- [11]
		},
		["乌特加德城堡"] = {
			"甲虫", -- [1]
			"蜘蛛", -- [2]
			"黑老鼠", -- [3]
		},
		["魔环"] = {
			"水晶蜘蛛", -- [1]
		},
		["安其拉废墟"] = {
			"甲虫", -- [1]
			"蝎子", -- [2]
			"蟑螂", -- [3]
		},
		["莫高雷"] = {
			"兔子", -- [1]
			"小瞪羚", -- [2]
			"耗子", -- [3]
			"草原土拨鼠", -- [4]
			"高山短尾兔", -- [5]
		},
		["锦绣谷"] = {
			"兴奋的萤火虫", -- [1]
			"欢跃水黾", -- [2]
			"金色麝猫", -- [3]
			"金色麝猫幼崽", -- [4]
			"锦绣阔步者", -- [5]
			"镀金飞蛾", -- [6]
			"黄腹牛蛙", -- [7]
		},
		["赤脊山"] = {
			"兔子", -- [1]
			"秃鹫雏鸟", -- [2]
			"蟑螂", -- [3]
			"赤脊山老鼠", -- [4]
			"高山短尾兔", -- [5]
			"鸡", -- [6]
		},
		["艾卓-尼鲁布"] = {
			"蜘蛛", -- [1]
			"蟑螂", -- [2]
		},
		["赞加沼泽"] = {
			"初生胞芽", -- [1]
			"小青蛙", -- [2]
			"蛇", -- [3]
		},
		["燃烧平原"] = {
			"火甲虫", -- [1]
			"熔岩蟹", -- [2]
			"熔火甲虫", -- [3]
			"燃灰蝰蛇", -- [4]
			"蝎子", -- [5]
			"蟑螂", -- [6]
		},
		["托维尔失落之城"] = {
			"沙漠蜘蛛", -- [1]
			"绿洲蛾", -- [2]
			"翡翠树蚺", -- [3]
			"胶皮蛙", -- [4]
			"蜣螂", -- [5]
			"蝗虫", -- [6]
		},
		["辛特兰"] = {
			"棕色土拨鼠", -- [1]
			"翡翠软泥怪", -- [2]
			"老鼠", -- [3]
			"蛆虫", -- [4]
			"蜘蛛", -- [5]
			"蟑螂", -- [6]
			"野兔", -- [7]
		},
		["阿拉希高地"] = {
			"小旋风", -- [1]
			"小青蛙", -- [2]
			"猫", -- [3]
			"老鼠", -- [4]
			"草原土拨鼠", -- [5]
			"草地短尾兔", -- [6]
			"野兔", -- [7]
		},
		["艾萨拉"] = {
			"兔子", -- [1]
			"坏松鼠5000型", -- [2]
			"暮光甲虫", -- [3]
			"暮光蜘蛛", -- [4]
			"机械小鸡", -- [5]
			"松鼠", -- [6]
			"海湾蟹", -- [7]
			"绿松乌龟", -- [8]
			"老鼠", -- [9]
			"臭鼬", -- [10]
			"蜘蛛", -- [11]
			"蟑螂", -- [12]
		},
		["北荆棘谷"] = {
			"林地小蜘蛛", -- [1]
			"树蟒", -- [2]
			"水蛇", -- [3]
			"波利", -- [4]
			"海湾蟹", -- [5]
			"甲虫", -- [6]
			"蛇", -- [7]
			"蜥蜴幼崽", -- [8]
			"蝰蛇", -- [9]
			"蟑螂", -- [10]
			"赤红飞蛾", -- [11]
			"长尾地道鼠", -- [12]
			"鹦鹉", -- [13]
		},
		["祖阿曼"] = {
			"松鼠", -- [1]
			"蜘蛛", -- [2]
		},
		["提瑞斯法林地"] = {
			"兔子", -- [1]
			"幽暗城老鼠", -- [2]
			"洛丹伦迷途者", -- [3]
			"老鼠", -- [4]
			"蛆虫", -- [5]
			"蜘蛛", -- [6]
			"蝙蝠", -- [7]
			"蟑螂", -- [8]
			"鸡", -- [9]
		},
		["灰谷"] = {
			"松鼠", -- [1]
			"森林蛾", -- [2]
			"海湾蟹", -- [3]
			"甲虫", -- [4]
			"老鼠", -- [5]
			"蛆虫", -- [6]
			"蟑螂", -- [7]
			"蟾蜍", -- [8]
			"锈色蜗牛", -- [9]
			"青蛙", -- [10]
		},
		["塔纳利斯"] = {
			"响尾蛇", -- [1]
			"沙漠小猫", -- [2]
			"沙漠蜘蛛", -- [3]
			"海鸥", -- [4]
			"纹尾蝎", -- [5]
			"臭虫", -- [6]
			"金甲虫", -- [7]
			"异种幼虫",
		},
		["灰熊丘陵"] = {
			"小鹿", -- [1]
			"山地臭鼬", -- [2]
			"灰色松鼠", -- [3]
			"皇家雏鹰", -- [4]
			"耗子", -- [5]
			"高地臭鼬", -- [6]
		},
		["沉没的神庙"] = {
			"老鼠", -- [1]
			"蛇", -- [2]
		},
		["希利苏斯"] = {
			"刺蜥", -- [1]
			"响尾蛇", -- [2]
			"沙漠蜘蛛", -- [3]
			"甲虫", -- [4]
			"甲虫幼虫", -- [5]
			"石蝰蛇", -- [6]
			"蝎子", -- [7]
			"角蜥", -- [8]
			"幼年其拉守护者",
		},
		["海加尔山"] = {
			"丝翅蛾", -- [1]
			"亡首蟑螂", -- [2]
			"兔子", -- [3]
			"小野兔", -- [4]
			"暮光甲虫", -- [5]
			"松鼠", -- [6]
			"森林蛾", -- [7]
			"洞穴鼠", -- [8]
			"火甲虫", -- [9]
			"燃灰蜥蜴", -- [10]
			"石蝰蛇", -- [11]
			"蝙蝠", -- [12]
			"诺达希尔小精灵", -- [13]
			"防火蟑螂", -- [14]
			"食腐鼠", -- [15]
			"高山花栗鼠", -- [16]
		},
	}
-----------------------------------------
--查找可捕获小宠物
--参数为 地图名或地图id
-----------------------------------------
function BattlePetDB_GetMapPets(map)
	-- if type(map) == "string" and t_mapsdata[map] then
		-- return t_mapsdata[map]
	-- elseif type(map) == "number" and map>0 then
		-- local mapName = select(map,GetMapZones(GetCurrentMapContinent()))
		-- if t_mapsdata [mapName] then
		-- return t_mapsdata [mapName]
		-- end
	-- end
end
-----------------------------------------
-----------------------------------------
--工具部分
-----------------------------------------
-----------------------------------------


-----------------------------------------
--创建未初始化的地图数据
-----------------------------------------
local function BattlePetDB_CreateMapData(index)
	local __,__,__,__,__,__,__,name,__,__,__,source,__,__,__,__ = C_PetJournal.GetPetInfoByIndex(index,false)
	-- print(source)
	if string.find (source,"|cFFFFD200宠物对战：|r") then     ---
		source = string.gsub(source,"|cFFFFD200宠物对战：|r","")
	
	else
		return 
	end
	if string.find(source,"声望") then
		return 
	end
	if string.find(source,"|n") then
		source = string.gsub(source,"|n","")
	end
	if string.find(source,"恐惧废土") then
		-- print(name,index)
	end
	source = source .. "、"
	for w in string.gmatch(source,"(.-)、")do
		if type(maps[w])~="table" then
			maps[w] = {}
		end
		table.insert(maps[w],name)
	end
	BattlePetInfo_Save.maps = maps
end

-----------------------------------------
--遍历每个小宠物手册中的宠物
-----------------------------------------
function _getPetData()
	local numPets = C_PetJournal.GetNumPets(false)
	for i = 1,numPets do
		BattlePetDB_CreateMapData(i)
		-- print(i)
	end
	-- numPets
end

