if GetLocale() =="zhCN" then
	ENABLE_ItemLevel_TEXT="开启装备等级";
elseif GetLocale() == "zhTW" then
	ENABLE_ItemLevel_TEXT = "開啟裝備等級";
end
-------------------注册插件类型-----------------------------------
--------------参数1 插件的名字-----------------------------------
--------------参数2 插件的类型。-----------------------------------
--------------参数3 启动插件是否需要重载界面。默认nil 可设置为true-----------------------------------
BFNew_RegisterAddon("ItemLevel",{BFNew_AddonTypeTable[7]},nil,nil,true)
--------------------------------------------------------------
--------------------------------------------------------------
-------------------注册插件互斥信息-------------------------------------------
-------------------参数1 互斥的插件名字列表的Tab-------------------------------------------
-- BFNew_RegisterAddonexclusiveTab({"Skada","Recount"})
--------------------注册插件配置信息----------------------------------
--------------参数1 插件的名字-----------------------------------
--------------参数2 配置的类型。-----------------------------------
--------------参数3 配置名字-----------------------------------
--------------参数4 配置显示的名字-----------------------------------
--------------参数5 配置的鼠标提示-----------------------------------
--------------参数6 （Checkbox）配置的默认值  ----  true false 不要为nil-----------------------------------
--------------参数7 （Checkbox）配置的CallBack函数  2个参数 第一个为 toggle_value  为 true or false  后一个为是否初始化的标识-----------------------------------
--------------参数8 配置的层级 默认0-----------------------------------

BFNew_RegisterAddonConfig("ItemLevel","CheckBox","EnableItemLevel",ENABLE_ItemLevel_TEXT,nil,
	true,-----默认值
	function(arg,init)
		if arg then
			ItemLevel_Tag(arg)
		end
	end
	)

-- InterfaceOptionsFrame_OpenToCategory(self.Options)